<?php
for($num = 10; $num > 0; $num--) {
    echo $num."\n";
}

echo '----------------------------------------------------------'."\r\n";

$arr = array('This', 'is', 'an', 'example');
foreach($arr as $value) {
    echo $value."\n";
}

echo '----------------------------------------------------------'."\r\n";
foreach($arr as $key => $value) {
    echo $key."=>".$value."\n";
}

echo '----------------------------------------------------------'."\r\n";
// 跳出多层循环的方法 continue 也是类似
for($a = 0; $a < 3; $a++) {
    for($b = 0; $b < 3; $b++) {
        echo $a.$b."\r\n";
        break; // 跳出本层循环
    }
}

echo '----------------------------------------------------------'."\r\n";

for($a = 0; $a < 3; $a++) {
    for($b = 0; $b < 3; $b++) {
        echo $a.$b."\r\n";
        break 2; // 跳出所有循环
    }
}

?>